libretiny-eu/libretiny/boards/wr3n/variant.h
/* This file was auto-generated from wr3n.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         10
#define NUM_ANALOG_INPUTS  1
#define NUM_DIGITAL_PINS   9
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A1 9u     // AD_2
#define A1     PIN_A1

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 2
#define PIN_WIRE0_SCL         0u // PA_29
#define PIN_WIRE0_SDA         4u // PA_30
#define PIN_WIRE1_SCL         7u // PA_18
#define PIN_WIRE1_SDA         8u // PA_23

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL0_RX          7u // PA_18
#define PIN_SERIAL0_TX          8u // PA_23
#define PIN_SERIAL2_RX          0u // PA_29
#define PIN_SERIAL2_TX          4u // PA_30
